# Pandas

<a href="https://colab.research.google.com/github/umsi-data-science/si370/blob/master/SI_370_Day_02_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Learning Objectives
* understand the role of pandas in python data science
* differentiate DataFrames, Series, and (numpy) arrays
* be able to use apply(), map() and applymap() to manipulate DataFrames and Series
* be able to handle missing values
* be able to filter rows and columns
* be able to sort by indexes and values

In [2]:
import pandas as pd
import numpy as np

dont call your data df as "df", that is hard to remember what it is

In [4]:
df = pd.DataFrame({"a": [1, 2, 3, 3, 2, 2],
                   "b": [4, 5, 6, 4, 5, 6],
                   "c": [7, 8, 9, 0, 0, 0]})

In [5]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
3  3  4  0
4  2  5  0
5  2  6  0

## Selecting a column

In [7]:
df['a'] #extract a series

0    1
1    2
2    3
3    3
4    2
5    2
Name: a, dtype: int64

Equivalently:

In [8]:
df.a

0    1
1    2
2    3
3    3
4    2
5    2
Name: a, dtype: int64

## Extracting the ndarray of values

In [10]:
# give the numpy array
df.a.values

array([1, 2, 3, 3, 2, 2], dtype=int64)

## Universal functions (h/t numpy)
* DataFrames and Series are easy to manipulate
* universal functions (ufuncs) are provided by numpy ndarrays

In [11]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9
3  3  4  0
4  2  5  0
5  2  6  0

In [12]:
df + 1

   a  b   c
0  2  5   8
1  3  6   9
2  4  7  10
3  4  5   1
4  3  6   1
5  3  7   1

In [13]:
df.a + 1

0    2
1    3
2    4
3    4
4    3
5    3
Name: a, dtype: int64

In [16]:
# assign to new column 
df['d'] = df['a'] + 1

In [17]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4
3  3  4  0  4
4  2  5  0  3
5  2  6  0  3

## map() and applymap()
* perform actions on elements in Series (.map()) or DataFrames (.applymap())

In [22]:
def divide_and_round(x): return round(x/10)

In [23]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4
3  3  4  0  4
4  2  5  0  3
5  2  6  0  3

In [24]:
df.applymap(divide_and_round)

   a  b  c  d
0  0  0  1  0
1  0  0  1  0
2  0  1  1  0
3  0  0  0  0
4  0  0  0  0
5  0  1  0  0

In [25]:
df.b.map(divide_and_round)

0    0
1    0
2    1
3    0
4    0
5    1
Name: b, dtype: int64

## Using .apply() to apply a function to an axis
* sometimes we want to apply a function not to just an element but to either entire columns or rows
* columns and rows are referred to as "axes"
* columns are "axis 0" and rows are "axis 1"

In [26]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4
3  3  4  0  4
4  2  5  0  3
5  2  6  0  3

In [27]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4
3  3  4  0  4
4  2  5  0  3
5  2  6  0  3

In [30]:
df.apply(np.mean, axis="rows")  # or axis=1, gives results for each column

a    2.166667
b    5.000000
c    4.000000
d    3.166667
dtype: float64

In [31]:
df.apply(np.mean, axis="columns") # axis=0

0    3.50
1    4.50
2    5.50
3    2.75
4    2.50
5    2.75
dtype: float64

## Counting value frequencies

In [32]:
df

   a  b  c  d
0  1  4  7  2
1  2  5  8  3
2  3  6  9  4
3  3  4  0  4
4  2  5  0  3
5  2  6  0  3

In [33]:
df.a

0    1
1    2
2    3
3    3
4    2
5    2
Name: a, dtype: int64

In [35]:
df.a.value_counts() #count amount number of valuas, indecending order

2    3
3    2
1    1
Name: a, dtype: int64

## Describing a DataFrame

In [36]:
df.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   2.166667  5.000000  4.000000  3.166667
std    0.752773  0.894427  4.427189  0.752773
min    1.000000  4.000000  0.000000  2.000000
25%    2.000000  4.250000  0.000000  3.000000
50%    2.000000  5.000000  3.500000  3.000000
75%    2.750000  5.750000  7.750000  3.750000
max    3.000000  6.000000  9.000000  4.000000

In [37]:
df['e'] = ["one", "two", "three", "four", "five", "six"]
df['f'] = [1.0, 5.0, 9.0, 10.1, 11.2, 12.3]

In [38]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [40]:
df.dtypes  #type

a      int64
b      int64
c      int64
d      int64
e     object
f    float64
dtype: object

In [41]:
#select datdatype we want
df.select_dtypes(include=['int', 'float'])

   a  b  c  d     f
0  1  4  7  2   1.0
1  2  5  8  3   5.0
2  3  6  9  4   9.0
3  3  4  0  4  10.1
4  2  5  0  3  11.2
5  2  6  0  3  12.3

## Missing values

* a missing value is just that -- it's missing
* represented as nan, NaN, NAN, np.nan, np.NaN (you get the idea)
* many tools that we'll be learning can't handle missing values
* you need to decide what to do with it
* can leave it as is, replace it with a scalar value, replace it with the output of a function (like mean), or drop the row
* think of what that would mean if you were going to calculate the mean of 1,2,3,NaN,4,5,6

In [42]:
df_missing = pd.DataFrame(
    {'a': [1, 2, 3, np.NaN],
     'b': [2, 3, np.NaN, 5]})

In [43]:
df_missing

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [48]:
# 1. .dropna() 
df_missing.dropna() #drop all rows with NAN

     a    b
0  1.0  2.0
1  2.0  3.0

In [49]:
df_missing.dropna(subset=['a']) #drop rows with NAN only in subset 'a'

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN

In [51]:
df_missing #not change the original df

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [52]:
# 2. .fillna()

df_missing.fillna(0) #with 0

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  0.0
3  0.0  5.0

In [54]:
df_missing.fillna(df_missing.mean()) #with mean of each column

     a         b
0  1.0  2.000000
1  2.0  3.000000
2  3.0  3.333333
3  2.0  5.000000

In [56]:
df_missing # still not change original df

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [57]:
df_missing.fillna(method='ffill') # with  the foreward value

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  3.0
3  3.0  5.0

In [58]:
df_missing

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  NaN
3  NaN  5.0

In [60]:
df_missing.fillna(method='bfill') # with  the backward value, if not so NAN

     a    b
0  1.0  2.0
1  2.0  3.0
2  3.0  5.0
3  NaN  5.0

## Setting and resetting indexes
* you can select which column is the index using .set_index()
* note that index values do not have to be unique
* you can also unset an index by using .reset_index()

In [61]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [62]:
df.set_index('e')

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
three  3  6  9  4   9.0
four   3  4  0  4  10.1
five   2  5  0  3  11.2
six    2  6  0  3  12.3

In [64]:
df.reset_index() # will have one more column called"index"

   index  a  b  c  d      e     f
0      0  1  4  7  2    one   1.0
1      1  2  5  8  3    two   5.0
2      2  3  6  9  4  three   9.0
3      3  3  4  0  4   four  10.1
4      4  2  5  0  3   five  11.2
5      5  2  6  0  3    six  12.3

## Filtering rows
* df.iloc[] will retrieve specific row number(s)
* df.loc[] will retrieve rows based on their index values
* df[df[col=value]] will filter
* df.query('col = value') will filter

In [65]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [71]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [72]:
df.iloc [1] # retrieve specific row number(s)

a      2
b      5
c      8
d      3
e    two
f    5.0
Name: 1, dtype: object

In [75]:
df.iloc[1:3] # retrieve specific row numbers (up to but not include 3)

   a  b  c  d      e    f
1  2  5  8  3    two  5.0
2  3  6  9  4  three  9.0

In [76]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [78]:
df.iloc[:,1].values # extract all rows, 1st column

array([4, 5, 6, 4, 5, 6], dtype=int64)

In [79]:
df

   a  b  c  d      e     f
0  1  4  7  2    one   1.0
1  2  5  8  3    two   5.0
2  3  6  9  4  three   9.0
3  3  4  0  4   four  10.1
4  2  5  0  3   five  11.2
5  2  6  0  3    six  12.3

In [82]:
df = df.set_index('e')

KeyError: "None of ['e'] are in the columns"

In [83]:
df

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
three  3  6  9  4   9.0
four   3  4  0  4  10.1
five   2  5  0  3  11.2
six    2  6  0  3  12.3

In [85]:
df.loc['two'] # retrieve rows based on their index values

a    2.0
b    5.0
c    8.0
d    3.0
f    5.0
Name: two, dtype: float64

In [86]:
df

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
three  3  6  9  4   9.0
four   3  4  0  4  10.1
five   2  5  0  3  11.2
six    2  6  0  3  12.3

In [88]:
df[df['a'] > 2] #d f[df[col=value]] will filter，return "Ture" rows when filter

       a  b  c  d     f
e
three  3  6  9  4   9.0
four   3  4  0  4  10.1

In [96]:
df[df['a'] > 2].d.value_counts()

4    2
Name: d, dtype: int64

In [93]:
df.query('a > 2')  # new in pandas, more readable

       a  b  c  d     f
e
three  3  6  9  4   9.0
four   3  4  0  4  10.1

## Sorting DataFrames
* you can either sort on index values (`df.sort_index()`) or on other values (`df.sort_values()`)

In [97]:
df

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
three  3  6  9  4   9.0
four   3  4  0  4  10.1
five   2  5  0  3  11.2
six    2  6  0  3  12.3

In [ ]:
df

In [99]:
df.sort_index() #alphabetically

       a  b  c  d     f
e
five   2  5  0  3  11.2
four   3  4  0  4  10.1
one    1  4  7  2   1.0
six    2  6  0  3  12.3
three  3  6  9  4   9.0
two    2  5  8  3   5.0

In [101]:
df.sort_values('a') # sort column, increasing order

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
five   2  5  0  3  11.2
six    2  6  0  3  12.3
three  3  6  9  4   9.0
four   3  4  0  4  10.1

In [103]:
df

       a  b  c  d     f
e
one    1  4  7  2   1.0
two    2  5  8  3   5.0
three  3  6  9  4   9.0
four   3  4  0  4  10.1
five   2  5  0  3  11.2
six    2  6  0  3  12.3

## End of notebook